{"comment":"A client library for authenticating with a remote service via OAuth2 on\nbehalf of a user, and making authorized HTTP requests with the user's OAuth2\ncredentials.\n\n## Installing ##\n\nUse [pub][] to install this package. Add the following to your\n`pubspec.yaml` file.\n\n    dependencies:\n      oauth2: any\n\nThen run `pub install`.\n\nFor more information, see the\n[oauth2 package on pub.dartlang.org][pkg].\n\nOAuth2 allows a client (the program using this library) to access and\nmanipulate a resource that's owned by a resource owner (the end user) and\nlives on a remote server. The client directs the resource owner to an\nauthorization server (usually but not always the same as the server that\nhosts the resource), where the resource owner tells the authorization server\nto give the client an access token. This token serves as proof that the\nclient has permission to access resources on behalf of the resource owner.\n\nOAuth2 provides several different methods for the client to obtain\nauthorization. At the time of writing, this library only supports the\n[AuthorizationCodeGrant] method, but further methods may be added in the\nfuture. The following example uses this method to authenticate, and assumes\nthat the library is being used by a server-side application.\n\n    import 'dart:io'\n    import 'package:oauth2/oauth2.dart' as oauth2;\n\n    // These URLs are endpoints that are provided by the authorization\n    // server. They're usually included in the server's documentation of its\n    // OAuth2 API.\n    final authorizationEndpoint =\n        Uri.parse(\"http://example.com/oauth2/authorization\");\n    final tokenEndpoint =\n        Uri.parse(\"http://example.com/oauth2/token\");\n    \n    // The authorization server will issue each client a separate client\n    // identifier and secret, which allows the server to tell which client\n    // is accessing it. Some servers may also have an anonymous\n    // identifier/secret pair that any client may use.\n    //\n    // Note that clients whose source code or binary executable is readily\n    // available may not be able to make sure the client secret is kept a\n    // secret. This is fine; OAuth2 servers generally won't rely on knowing\n    // with certainty that a client is who it claims to be.\n    final identifier = \"my client identifier\";\n    final secret = \"my client secret\";\n\n    // This is a URL on your application's server. The authorization server\n    // will redirect the resource owner here once they've authorized the\n    // client. The redirection will include the authorization code in the\n    // query parameters.\n    final redirectUrl = Uri.parse(\n        \"http://my-site.com/oauth2-redirect\");\n    \n    var credentialsFile = new File(\"~/.myapp/credentials.json\");\n    return credentialsFile.exists().then((exists) {\n      // If the OAuth2 credentials have already been saved from a previous\n      // run, we just want to reload them.\n      if (exists) {\n        return credentialsFile.readAsString().then((json) {\n          var credentials = new oauth2.Credentials.fromJson(json);\n          return new oauth2.Client(identifier, secret, credentials);\n        });\n      }\n    \n      // If we don't have OAuth2 credentials yet, we need to get the\n      // resource owner to authorize us. We're assuming here that we're a\n      // command-line application.\n      var grant = new oauth2.AuthorizationCodeGrant(\n          identifier, secret, authorizationEndpoint, tokenEndpoint);\n    \n      // Redirect the resource owner to the authorization URL. This will be\n      // a URL on the authorization server (authorizationEndpoint with some\n      // additional query parameters). Once the resource owner has\n      // authorized, they'll be redirected to `redirectUrl` with an\n      // authorization code.\n      //\n      // `redirect` is an imaginary function that redirects the resource\n      // owner's browser.\n      return redirect(grant.getAuthorizationUrl(redirectUrl)).then((_) {\n        // Another imaginary function that listens for a request to\n        // `redirectUrl`.\n        return listen(redirectUrl);\n      }).then((request) {\n        // Once the user is redirected to `redirectUrl`, pass the query\n        // parameters to the AuthorizationCodeGrant. It will validate them\n        // and extract the authorization code to create a new Client.\n        return grant.handleAuthorizationResponse(request.uri.queryParameters);\n      })\n    }).then((client) {\n      // Once you have a Client, you can use it just like any other HTTP\n      // client.\n      return client.read(\"http://example.com/protected-resources.txt\")\n          .then((result) {\n        // Once we're done with the client, save the credentials file. This\n        // ensures that if the credentials were automatically refreshed\n        // while using the client, the new credentials are available for the\n        // next run of the program.\n        return credentialsFile.open(FileMode.WRITE).then((file) {\n          return file.writeString(client.credentials.toJson());\n        }).then((file) => file.close()).then((_) => result);\n      });\n    }).then(print);\n\n[pub]: http://pub.dartlang.org\n[pkg]: http://pub.dartlang.org/packages/oauth2","uri":"package:oauth2/oauth2.dart","name":"package:oauth2/oauth2.dart","id":"oauth2","line":"118","kind":"library"}